path_list = ['D:/Универ/НИР/Второй семак/Phrase_1_16_model-ru-0.10',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-ru-0.10-lgraph',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-ru-0.22',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-ru-0.42',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-small-ru-0.15',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-small-ru-0.3',
            'D:/Универ/НИР/Второй семак/Phrase_1_16_model-small-ru-0.22',
             'D:/Универ/НИР/Второй семак/Phrase_1_16_model-small-ru-0.4',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-ru-0.10',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-ru-0.10-lgraph',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-ru-0.22',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-ru-0.42',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-small-ru-0.15',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-small-ru-0.22',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-small-ru-0.3',
             'D:/Универ/НИР/Второй семак/Phrase_de_noise_16_model-small-ru-0.4'
             ]
path_list1 = ['/16/14.10.2013', '/16/16.03.2016',
        '/16/25.09.2013', '/27/19.08.2014',
        '/27/25.07.2014', '/27/30.04.2014',
        '/28/14.07.2014', '/28/20.08.2014',
        '/28/29.07.2014', '/30/20.10.2014',
        '/30/24.09.2014', '/30/29.08.2014',
        '/37/03.04.2015', '/37/17.04.2015',
        '/37/29.02.2016', '/44/03.11.2015',
        '/44/13.11.2015', '/44/31.08.2015',
        '/46/07.10.2015', '/46/15.09.2015',
        '/46/29.09.2015', '/48/04.03.2016',
        '/48/14.01.2016', '/48/29.01.2016',
        '/54/05.05.2016', '/54/19.01.2017',
        '/54/21.03.2016', '/56/21.03.2016',
        '/56/27.04.2016', '/59/05.05.2016',
        '/59/11.04.2016', '/59/12.05.2016',
        '/62/09.09.2016', '/62/17.05.2016',
        '/62/27.04.2016', '/65/09.08.2016',
        '/65/12.08.2016', '/65/26.07.2016',
        '/68/14.09.2016', '/68/18.01.2017',
        '/68/22.08.2016', '/68/30.11.2016',
        '/69/07.10.2016', '/69/12.09.2016',
        '/71/11.10.2016', '/71/12.12.2016',
        '/71/28.03.2017', '/71/29.11.2016',
        '/72/27.10.2016', '/72/29.11.2016',
        '/74/16.12.2016', '/74/23.11.2016',
        '/75/19.12.2016', '/75/31.10.2017',
        '/77/06.02.2017', '/77/16.02.2017',
        '/77/18.01.2017', '/77/22.02.2017',
        '/78/06.04.2017', '/78/20.03.2017']
file = ['/levenstein.txt']
new_path_list = []
new_path_list1 = []
sum = 0

for path in path_list:
    for path1 in path_list1:
        new_path = path + path1 + file[0]
        new_path1 = path + path1
        new_path_list1.append(new_path1)
        new_path_list.append(new_path)

print(new_path_list)

for i in range(len(new_path_list)):
    with open(new_path_list[i], 'r', encoding='utf-8') as f:
        lines = f.readlines()

    lines = [line.rstrip() for line in lines]

    for line in lines:
        sum += int(line)
    sum = sum/681


    with open(f'{new_path_list1[i]}/sum.txt', 'w') as f:
        f.write(str(sum))

    sum = 0
